edocecchini01/pacman-LPC1768/PacMan/Source/sample.c
/****************************************Copyright (c)****************************************************
**                                      
**                                 http://www.powermcu.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               main.c
** Descriptions:            The GLCD application function
**
**--------------------------------------------------------------------------------------------------------
** Created by:              AVRman
** Created date:            2010-11-7
** Version:                 v1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             Paolo Bernardi
** Modified date:           03/01/2020
** Version:                 v2.0
** Descriptions:            basic program for LCD and Touch Panel teaching
**
*********************************************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "LPC17xx.h"
#include "button_EXINT/button.h"
#include "GLCD/GLCD.h" 
#include "TouchPanel/TouchPanel.h"
#include "timer/timer.h"
#include "RIT/RIT.h"
#include "draw_img/draw.h"
#include "game_logic/gameL.h"
#include "utils/utils.h"


#ifdef SIMULATOR
extern uint8_t ScaleFlag; // <- ScaleFlag needs to visible in order for the emulator to find the symbol (can be placed also inside system_LPC17xx.h but since it is RO, it needs more work)
#endif

volatile const mapOff[2] = {8,32}; //offset x,y

volatile game_state gs = {
		.posPac_Row = 0,
		.posPac_Col = 0,
		.countDown = 60,
		.score = 0,
		.lives = 1,
		.next_life_threshold = 1000,
		.actDir = STOP,
		.isPause = 0
};

volatile GUI_changes guiCh = {
		.changeScore = 0,
		.changeTime = 0,
		.changeLive = 0
};

int main(void)
{
  SystemInit();  												/* System Initialization (i.e., PLL)  */
  BUTTON_init();												/* BUTTON Initialization              */
	joystick_init();											/* Joystick Initialization            */
	init_RIT(0x004C4B40);								  /* RIT Initialization 50 msec       	*/
	enable_RIT();
	
  LCD_Initialization();
	
	LCD_Clear(Black);
	
	draw_backgoround(mapOff[0], mapOff[1]);
	
	game_init();
	
	LPC_SC->PCON |= 0x1;									/* power-down	mode										*/
	LPC_SC->PCON &= ~(0x2);						
	
  while (1)	
  {
		__ASM("wfi");
  }
}

/*********************************************************************************************************
      END FILE
*********************************************************************************************************/
